app/views/cockpit/_view_statistics.html.erb

        <td colspan="2">Klassen</td>
        <td colspan="2"><strong><%= Team.where(event_id: getLoginEventId).count %></strong></td>
---
SELECT COUNT(*) FROM "teams"  WHERE "teams"."event_id" = 1

        <td colspan="2">Lehrer</td>
        <% num_teachers = Teacher.where(event_id: getLoginEventId).count %>
---
SELECT COUNT(*) FROM "teachers"  WHERE "teachers"."event_id" = 1

        <td colspan="2">Schüler</td>
        <td colspan="2"><strong><%= Student.where(event_id: getLoginEventId).count %></strong></td>
---
SELECT COUNT(*) FROM "students"  WHERE "students"."event_id" = 1

        <td colspan="2">Slots</td>
        <% num_slots = Slot.where(event_id: getLoginEventId).count %>
---
SELECT COUNT(*) FROM "slots"  WHERE "slots"."event_id" = 1

      <% max_reservations = num_teachers * num_slots %>
      <% num_availabilities = Reservation.where(event_id: getLoginEventId).count %>
      <% num_availabilities_open = Reservation.where(event_id: getLoginEventId, status: Reservation::RESERVATION_AVAILABILITY_OPEN).count %>
---
SELECT COUNT(*) FROM "reservations"  WHERE "reservations"."event_id" = 1
SELECT COUNT(*) FROM "reservations"  WHERE "reservations"."event_id" = 1 AND "reservations"."status" = -1

      </tr>
      <% num_reservations_effective = Reservation.where(event_id: getLoginEventId).where.not(student_id: nil).count %>
---
SELECT COUNT(*) FROM "reservations"  WHERE "reservations"."event_id" = 1 AND ("reservations"."student_id" IS NOT NULL)