app/controllers/login_controller.rb

	def login

		reset_session

		if request.post?

			loginEmail = params[:login][:loginEmail]
			loginPassword = params[:login][:loginPassword]
			loginevent_id = params[:login][:loginevent_id]

			loginuser = checkLogin(loginEmail, loginPassword)
			if loginuser != nil
				noticeString = "Anmeldung mit Email: %s war erfolgreich!" % [loginEmail]
				session[:user_id] = loginuser.id
				session[:user_email] = loginuser.email
				session[:user_name] = loginuser.name
				session[:user_firstname] = loginuser.firstname
				session[:user_role_type] = loginuser.role_type
				session[:event_id] = loginevent_id
				session[:previous_login] = loginuser.last_login_at
				session[:last_seen] = Time.now
				loginuser.update_columns(:last_login_at => Time.now)
---
UPDATE "users" SET "last_login_at" = '2015-12-05 06:26:15.164952' WHERE "users"."id" = 1