app/controllers/users_controller.rb

  def index
	  if !isLogin
		  redirect_to controller: 'login', action: 'login'
		  return
	  end
    @users = User.all.order("id").paginate(page: params[:page], per_page: ROWSperPAGE)
---
SELECT "users".* FROM "users"   ORDER BY id